; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	infrared1 - mode
	infrared0 - mode
	spectrograph2 - mode
	Star1 - direction
	Star2 - direction
	GroundStation0 - direction
	Star3 - direction
	Star4 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Star18 - direction
	Star19 - direction
	Star20 - direction
	Planet21 - direction
	Phenomenon22 - direction
	Phenomenon23 - direction
	Star24 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon22)
	(supports instrument3 infrared0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star2)
	(supports instrument5 infrared1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet5)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star2)
	(supports instrument7 spectrograph2)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 infrared0)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
	(supports instrument9 infrared1)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 Star3)
	(supports instrument10 spectrograph2)
	(supports instrument10 infrared0)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
)
(:goal (and
	(pointing satellite2 Phenomenon23)
	(have_image Planet5 infrared1)
	(have_image Planet6 spectrograph2)
	(have_image Planet7 infrared1)
	(have_image Star8 infrared1)
	(have_image Phenomenon9 infrared1)
	(have_image Star10 infrared1)
	(have_image Phenomenon11 infrared1)
	(have_image Planet13 spectrograph2)
	(have_image Phenomenon14 spectrograph2)
	(have_image Phenomenon15 infrared1)
	(have_image Phenomenon16 spectrograph2)
	(have_image Star17 infrared1)
	(have_image Star18 infrared0)
	(have_image Star19 spectrograph2)
	(have_image Star20 infrared0)
	(have_image Planet21 spectrograph2)
	(have_image Phenomenon23 spectrograph2)
	(have_image Star24 infrared0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 19
2. (turn_to satellite4 phenomenon11 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 19
3. (turn_to satellite4 star4 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 star4)
   goals met: 0 of 19
4. (calibrate satellite4 instrument10 star4)
   added: (calibrated instrument10)
   goals met: 0 of 19
5. (turn_to satellite4 phenomenon11 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 19
6. (take_image satellite4 phenomenon11 instrument10 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 1 of 19
7. (turn_to satellite4 phenomenon14 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon14)
   goals met: 1 of 19
8. (take_image satellite4 phenomenon14 instrument10 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 2 of 19
9. (turn_to satellite4 phenomenon15 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon15)
   goals met: 2 of 19
10. (take_image satellite4 phenomenon15 instrument10 infrared1)
   added: (have_image phenomenon15 infrared1)
   goals met: 3 of 19
11. (turn_to satellite4 phenomenon16 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon16)
   goals met: 3 of 19
12. (take_image satellite4 phenomenon16 instrument10 spectrograph2)
   added: (have_image phenomenon16 spectrograph2)
   goals met: 4 of 19
13. (turn_to satellite4 phenomenon23 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 phenomenon23)
   goals met: 4 of 19
14. (take_image satellite4 phenomenon23 instrument10 spectrograph2)
   added: (have_image phenomenon23 spectrograph2)
   goals met: 5 of 19
15. (turn_to satellite4 phenomenon9 phenomenon23)
   deleted: (pointing satellite4 phenomenon23)
   added: (pointing satellite4 phenomenon9)
   goals met: 5 of 19
16. (take_image satellite4 phenomenon9 instrument10 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 6 of 19
17. (turn_to satellite4 planet13 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet13)
   goals met: 6 of 19
18. (take_image satellite4 planet13 instrument10 spectrograph2)
   added: (have_image planet13 spectrograph2)
   goals met: 7 of 19
19. (turn_to satellite4 planet21 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet21)
   goals met: 7 of 19
20. (take_image satellite4 planet21 instrument10 spectrograph2)
   added: (have_image planet21 spectrograph2)
   goals met: 8 of 19
21. (turn_to satellite4 planet5 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 planet5)
   goals met: 8 of 19
22. (take_image satellite4 planet5 instrument10 infrared1)
   added: (have_image planet5 infrared1)
   goals met: 9 of 19
23. (turn_to satellite4 planet6 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 planet6)
   goals met: 9 of 19
24. (take_image satellite4 planet6 instrument10 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 10 of 19
25. (turn_to satellite4 planet7 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet7)
   goals met: 10 of 19
26. (take_image satellite4 planet7 instrument10 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 11 of 19
27. (turn_to satellite4 star10 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star10)
   goals met: 11 of 19
28. (take_image satellite4 star10 instrument10 infrared1)
   added: (have_image star10 infrared1)
   goals met: 12 of 19
29. (turn_to satellite4 star17 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star17)
   goals met: 12 of 19
30. (take_image satellite4 star17 instrument10 infrared1)
   added: (have_image star17 infrared1)
   goals met: 13 of 19
31. (turn_to satellite4 star18 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star18)
   goals met: 13 of 19
32. (take_image satellite4 star18 instrument10 infrared0)
   added: (have_image star18 infrared0)
   goals met: 14 of 19
33. (turn_to satellite4 star19 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 star19)
   goals met: 14 of 19
34. (take_image satellite4 star19 instrument10 spectrograph2)
   added: (have_image star19 spectrograph2)
   goals met: 15 of 19
35. (turn_to satellite4 star20 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star20)
   goals met: 15 of 19
36. (take_image satellite4 star20 instrument10 infrared0)
   added: (have_image star20 infrared0)
   goals met: 16 of 19
37. (turn_to satellite4 star24 star20)
   deleted: (pointing satellite4 star20)
   added: (pointing satellite4 star24)
   goals met: 16 of 19
38. (take_image satellite4 star24 instrument10 infrared0)
   added: (have_image star24 infrared0)
   goals met: 17 of 19
39. (turn_to satellite4 star8 star24)
   deleted: (pointing satellite4 star24)
   added: (pointing satellite4 star8)
   goals met: 17 of 19
40. (take_image satellite4 star8 instrument10 infrared1)
   added: (have_image star8 infrared1)
   goals met: 18 of 19
41. (turn_to satellite2 phenomenon23 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 phenomenon23)
   goals met: 19 of 19
